import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-services-tabs',
  templateUrl: './services-tabs.component.html',
  styleUrls: ['./services-tabs.component.css']
})
export class ServicesTabsComponent implements OnInit {
 //cardTitle : string ="gggggg";
  //cardDescription : string ="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx";

  ServiceCard: any[] =[
    {
    "CardTitle": "خدمة إشغال الوظائف بالترقيات",
    "CardText":"خدمة الكترونية تمكن الجهات الحكومية من ترقية موظفيها إما عن طريق الطرح و المفاضلة أو بالترقية الاستثنائية مما يساهم في حوكمة عملية الترقيات بالكامل بجميع أنواعها.​خدمة الكترونية تمكن الجهات الحكومية من ترقية موظفيها إما عن طريق الطرح و المفاضلة أو بالترقية الاستثنائية مما يساهم في حوكمة عملية الترقيات بالكامل بجميع أنواعها.​​",
    },
    {
      "CardTitle": "خدمة إشغال الوظائف بالترقيات",
      "CardText":"خدمة الكترونية تمكن الجهات الحكومية من ترقية موظفيها إما عن طريق الطرح و المفاضلة أو بالترقية الاستثنائية مما يساهم في حوكمة عملية الترقيات بالكامل بجميع أنواعها.​خدمة الكترونية تمكن الجهات الحكومية من ترقية موظفيها إما عن طريق الطرح و المفاضلة أو بالترقية الاستثنائية مما يساهم في حوكمة عملية الترقيات بالكامل بجميع أنواعها.​​",
    },
    {
      "CardTitle": "خدمة إشغال الوظائف بالترقيات",
      "CardText":"خدمة الكترونية تمكن الجهات الحكومية من ترقية موظفيها إما عن طريق الطرح و المفاضلة أو بالترقية الاستثنائية مما يساهم في حوكمة عملية الترقيات بالكامل بجميع أنواعها.​خدمة الكترونية تمكن الجهات الحكومية من ترقية موظفيها إما عن طريق الطرح و المفاضلة أو بالترقية الاستثنائية مما يساهم في حوكمة عملية الترقيات بالكامل بجميع أنواعها.​​",
    },
    {
      "CardTitle": "خدمة إشغال الوظائف بالترقيات",
      "CardText":"خدمة الكترونية تمكن الجهات الحكومية من ترقية موظفيها إما عن طريق الطرح و المفاضلة أو بالترقية الاستثنائية مما يساهم في حوكمة عملية الترقيات بالكامل بجميع أنواعها.​خدمة الكترونية تمكن الجهات الحكومية من ترقية موظفيها إما عن طريق الطرح و المفاضلة أو بالترقية الاستثنائية مما يساهم في حوكمة عملية الترقيات بالكامل بجميع أنواعها.​​",
    },
    {
      "CardTitle": "خدمة إشغال الوظائف بالترقيات",
      "CardText":"خدمة الكترونية تمكن الجهات الحكومية من ترقية موظفيها إما عن طريق الطرح و المفاضلة أو بالترقية الاستثنائية مما يساهم في حوكمة عملية الترقيات بالكامل بجميع أنواعها.​خدمة الكترونية تمكن الجهات الحكومية من ترقية موظفيها إما عن طريق الطرح و المفاضلة أو بالترقية الاستثنائية مما يساهم في حوكمة عملية الترقيات بالكامل بجميع أنواعها.​​",
    },
    {
      "CardTitle": "خدمة إشغال الوظائف بالترقيات",
      "CardText":"خدمة الكترونية تمكن الجهات الحكومية من ترقية موظفيها إما عن طريق الطرح و المفاضلة أو بالترقية الاستثنائية مما يساهم في حوكمة عملية الترقيات بالكامل بجميع أنواعها.​خدمة الكترونية تمكن الجهات الحكومية من ترقية موظفيها إما عن طريق الطرح و المفاضلة أو بالترقية الاستثنائية مما يساهم في حوكمة عملية الترقيات بالكامل بجميع أنواعها.​​",
    }
  ];

  constructor() { }

  ngOnInit() {
  }

}
